package com.javanajautc.theba.java_naja;

public class Quiz_True_False_Chap6 {

    public static String[] questions = new String []{
            "เมธอดหลายๆ เมธอดในคลาสสามารถเรียกกันเองได้",
            "แต่ละเมธอดในคลาสห้ามมีตัวแปรที่มีชื่อเหมือนกัน ",
            "เมื่อเขียนคอนสตรัคเตอร์ไว้ในคลาส มันจะถูกเรียกขึ้นมาทํางานทุกครั้งเมื่อสร้างออบเจ็กของคลาส",
            "เมธอดที่สร้างขึ้นในคลาสสามารถเรียกเมธอดในคลาสอื่นได้ ถ้าหากเป็นเมธอดแบบ public ",
            "ทุกเมธอดที่สร้างขึ้นในคลาสจะต้องมีคําว่า return",
            "ในคลาสสามารถมีคอนสตรัคเตอร์ได้เพียงตัวเดียว",
            "การตั้งชื่อคลาสจะใช้หลักการเหมือนกับการตั้งชื่อตัวแปร"
    };

    public static boolean[] answers = new boolean[]{
            true, false, true, true, false, false, true
    };

}