package com.javanajautc.theba.java_naja;

public class Quiz_True_False_Chap4 {

    public static String[] questions = new String []{
            "การสร้างเมธอดจะต้องสร้างไว้หลังเมธอด main เสมอ",
            "ถ้าหากฟังก์ชันไม่มีการคืนค่าจะต้องใช้คําว่า void นําหน้า",
            "เมธอดที่สร้างขึ้นสามารถเรียกเมธอดอื่นๆ ที่สร้างขึ้นมาใช้งานได้",
            "ทุกเมธอดที่สร้างขึ้นจะต้องมีคําว่า return",
            "เมธอดหลายเมธอดสามารถประกาศตัวแปรภายในให้มีชื่อเดียวกันได้",
            "การเขียนส่วนหัวของเมธอดต้องจบด้วยเครื่องหมายเซมีโคลอน",
            "ตัวแปรพารามิเตอร์คือตัวแปรที่ใช้ได้ภายในเมธอดเท่านั้น",
            "คําว่า return จะใช้ในเมธอดที่มีการคืนค่าข้อมูลกลับ"
    };

    public static boolean[] answers = new boolean[]{
            false, true, true, false, true, false, true, true
    };

}

